app.controller("searchCtrl", function ($scope) {
    $scope.region = ["גליל עליון", "גליל תחתון", "אצבע הגליל", "בקעת הירדן", "הערבה", "הנגב", "השפלה", "השרון", "חיפה והסביבה", "יהודה", "השומרון", "השפלה", "מדבר יהודה", "עמק יזרעל",
        "אילת והסביבה", "ירושלים והסביבה", "רמת הגולן", "ים המלח והסביבה", "רמת הגולן", "הגליל המערבי", "מישור החוף הצפוני", "מישור החוף יהודה", "גוש דן", "בקעת באר שבע", "מכתשים בנגב",
        "הר הנגב", "הרי אילת", "חבל הבשור", "ארץ כינורות", "בקעת בית שאן", "בקעת ים המלח"];
});     